<!-- add-pr-comment:add-pr-comment -->

Terraform Plan **production **:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.crom_vpc.module.vpc.aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       tags                   = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-default"
        }
+       tags_all               = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-default"
        }
+       vpc_id                 = (known after apply)

+       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
        }
+       egress {
+           action     = "allow"
+           cidr_block = "0.0.0.0/0"
+           from_port  = 0
+           protocol   = "-1"
+           rule_no    = 100
+           to_port    = 0
        }

+       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
        }
+       ingress {
+           action     = "allow"
+           cidr_block = "0.0.0.0/0"
+           from_port  = 0
+           protocol   = "-1"
+           rule_no    = 100
+           to_port    = 0
        }
    }

  # module.crom_vpc.module.vpc.aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       route                  = (known after apply)
+       tags                   = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-default"
        }
+       tags_all               = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-default"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-default"
        }
+       tags_all               = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-default"
        }
+       vpc_id                 = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
+       tags_all             = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
+       vpc                  = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
+       tags_all = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
+       vpc_id   = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
+       tags_all                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
    }

  # module.crom_vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-private"
        }
+       tags_all         = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-private"
        }
+       vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public"
        }
+       tags_all         = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public"
        }
+       vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[2] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.0.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Private Subnet One"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Private Subnet One"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Private Subnet Two"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Private Subnet Two"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[2] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-private-us-east-1c"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-private-us-east-1c"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.4.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public-us-east-1a"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public-us-east-1a"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.5.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public-us-east-1b"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public-us-east-1b"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[2] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.6.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public-us-east-1c"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public-us-east-1c"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
+       tags_all                             = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
    }

Plan: 23 to add, 0 to change, 0 to destroy. 
```

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.crom_vpc.module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-default"
        }
      + tags_all               = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-default"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.crom_vpc.module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-default"
        }
      + tags_all               = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-default"
        }
      + tags_all               = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
      + tags_all             = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
      + vpc                  = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
      + tags_all = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
      + vpc_id   = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
      + tags_all                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
    }

  # module.crom_vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-private"
        }
      + tags_all         = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public"
        }
      + tags_all         = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Private Subnet One"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Private Subnet One"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Private Subnet Two"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Private Subnet Two"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-private-us-east-1c"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-private-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public-us-east-1a"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public-us-east-1b"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public-us-east-1c"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
      + tags_all                             = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
    }

Plan: 23 to add, 0 to change, 0 to destroy.
 
```